# DeleteViewport Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheet..::..DeleteViewport Method
ViewSheet Class See Also
---
Removes a viewport from the sheet by deleting it from the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void DeleteViewport(
	Viewport viewport
)
```

Visual Basic
---
```text
Public Sub DeleteViewport ( _
	viewport As Viewport _
)
```

Visual C++
---
```text
public:
void DeleteViewport(
	Viewport^ viewport
)
```

# ### Parameters
viewport
    Type: Autodesk.Revit.DB..::..Viewport The viewport that will be deleted and removed from the sheet.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewSheet Class
Autodesk.Revit.DB Namespace